from aiogram.types import ReplyKeyboardMarkup, KeyboardButton


def check_the_dick_for_key(dick, key_find):
    for key in dick:
        if key_find == key:
            return 1
    return 0


# кнопки городов
nums_stikers = ["1️⃣", "2️⃣", "3️⃣", "4️⃣", "5️⃣", "6️⃣", "7️⃣", "8️⃣", "9️⃣"]
slash = "--------------------------------------------------------- \n"
nl = '\n'
pogoda_stikers = [
    "☀️",  # 1
    "🌫️",  # 2

    "🌤️",  # 3
    "🌦️",  # 4
    "⛈️",  # 5
    "🌦️",  # 6
    "⛈️",  # 7
    "🌦️",  # 8
    "⛈️",  # 9
    "❄️🌧️❄️",  # 10
    "❄️⛈️❄️",  # 11
    '❄️🌧️❄️',  # 12
    '❄️⛈️❄️',  # 13
    '❄️🌧️❄️',  # 14
    '❄️⛈️❄️',  # 15
    '🌨️',  # 16

    "⚡🌨️⚡",  # 17
    "🌨️",  # 18
    "⚡🌨️⚡",  # 19
    "🌨️",  # 20
    "⚡🌨️⚡",  # 21
    "🌤️",  # 22
    "🌦️",  # 23
    "⛈️",  # 24
    "🌦️",  # 25
    "⛈️",  # 26
    "🌦️",  # 27
    '⛈️',  # 28
    '❄️🌧️❄️',  # 29
    '❄️⛈️❄️',  # 30
    '❄️🌧️❄️',  # 31
    '❄️⛈️❄️',  # 32

    "❄️🌧️❄️",  # 33
    "❄️⛈️❄️",  # 34
    "🌨️",  # 35
    "⚡🌨️⚡",  # 36
    "🌨️",  # 37
    "⚡🌨️⚡",  # 38
    "🌨️",  # 39
    "⚡🌨️⚡",  # 40
    "🌥️",  # 41
    "🌦️",  # 42
    "⛈️",  # 43
    '🌦️',  # 44
    '⛈️',  # 45
    '🌦️',  # 46
    '⛈️',  # 47
    '❄️🌧️❄️',  # 48

    "❄️⛈️❄️",  # 49
    "❄️🌧️❄️",  # 50
    "❄️⛈️❄️",  # 51
    "❄️🌧️❄️",  # 52
    "❄️⛈️❄️",  # 53
    "🌨️",  # 54
    "⚡🌨️⚡",  # 55
    "🌨️",  # 56
    "⚡🌨️⚡",  # 57
    "🌨️",  # 58
    "⚡🌨️⚡",  # 59
    '☁️',  # 60
    '🌧️',  # 61
    '⛈️',  # 62
    '🌧️',  # 63
    '⛈️',  # 64

    "🌧",  # 65
    "⛈️",  # 66
    "❄️🌧️❄️",  # 67
    "❄️⛈️❄️",  # 68
    "❄️🌧️❄️",  # 69
    "❄️⛈️❄️",  # 70
    "❄️🌧️❄️",  # 71
    "❄️⛈️❄️",  # 72
    "🌨️",  # 73
    "⚡🌨️⚡",  # 74
    "🌨️",  # 75
    '⚡🌨️⚡',  # 76
    '🌨️',  # 77
    '⚡🌨️⚡',  # 78
]
pogoda_phrase = [
    "Солнечно",  # 1
    "Туман",  # 2

    "Малооблачно, без осадков",  # 3
    "Малооблачно, слабый дождь",  # 4
    "Малооблачно, слабый дождь, гроза",  # 5
    "Малооблачно, дождь",  # 6
    "Малооблачно, дождь, гроза",  # 7
    "Малооблачно, сильный дождь",  # 8
    "Малооблачно, сильный дождь, гроза",  # 9
    "Малооблачно, слабый дождь и снег",  # 10
    "Малооблачно, слабый дождь и снег, гроза",  # 11
    "Малооблачно, дождь и снег",  # 12
    "Малооблачно, дождь и снег, гроза",  # 13
    "Малооблачно, сильный дождь и снег",  # 14
    "Малооблачно, сильный дождь и снег, гроза",  # 15
    "Малооблачно, слабый снег",  # 16

    "Малооблачно, слабый снег, гроза",  # 17
    "Малооблачно, снег",  # 18
    "Малооблачно, снег, гроза",  # 19
    "Малооблачно, сильный снег",  # 20
    "Малооблачно, сильный снег, гроза",  # 21

    "Малооблачно, без осадков",  # 22
    "Малооблачно, слабый дождь",  # 23
    "Малооблачно, слабый дождь, гроза",  # 24
    "Малооблачно, дождь",  # 25
    "Малооблачно, дождь, гроза",  # 26
    "Малооблачно, сильный дождь",  # 27
    "Малооблачно, сильный дождь, гроза",  # 28
    "Малооблачно, слабый дождь и снег",  # 29
    "Малооблачно, слабый дождь и снег, гроза",  # 30
    "Малооблачно, дождь и снег",  # 31
    "Малооблачно, дождь и снег, гроза",  # 32

    "Малооблачно, сильный дождь и снег",  # 33
    "Малооблачно, сильный дождь и снег, гроза",  # 34
    "Малооблачно, слабый снег",  # 35
    "Малооблачно, слабый снег, гроза",  # 36
    "Малооблачно, снег",  # 37
    "Малооблачно, снег, гроза",  # 38
    "Малооблачно, сильный снег",  # 39
    "Малооблачно, сильный снег, гроза",  # 40

    "Облачно, без осадков",  # 41
    "Облачно, слабый дождь",  # 42
    "Облачно, слабый дождь, гроза",  # 43
    "Облачно, дождь"  # 44
    "Облачно, дождь, гроза",  # 45
    "Облачно, сильный дождь",  # 46
    "Облачно, сильный дождь, гроза",  # 47
    "Облачно, слабый дождь и снег",  # 48

    "Облачно, слабый дождь и снег, гроза",  # 49
    "Облачно, дождь и снег",  # 50
    "Облачно, дождь и снег, гроза",  # 51
    "Облачно, сильный дождь и снег",  # 52
    "Облачно, сильный дождь и снег, гроза",  # 53
    "Облачно, слабый снег",  # 54
    "Облачно, слабый снег, гроза",  # 55
    "Облачно, снег",  # 56
    "Облачно, снег, гроза",  # 57
    "Облачно, сильный снег",  # 58
    "Облачно, сильный снег, гроза",  # 59

    "Пасмурно, без осадков",  # 60
    "Пасмурно, слабый дождь",  # 61
    "Пасмурно, слабый дождь, гроза",  # 62
    "Пасмурно, дождь",  # 63
    "Пасмурно, дождь, гроза",  # 64

    "Пасмурно, сильный дождь",  # 65
    "Пасмурно, сильный дождь, гроза",  # 66
    "Пасмурно, слабый дождь и снег",  # 67
    "Пасмурно, слабый дождь и снег, гроза",  # 68
    "Пасмурно, дождь и снег",  # 69
    "Пасмурно, дождь и снег, гроза",  # 70
    "Пасмурно, сильный дождь и снег",  # 71
    "Пасмурно, сильный дождь и снег, гроза",  # 72
    "Пасмурно, слабый снег",  # 73
    "Пасмурно, слабый снег, гроза",  # 74
    "Пасмурно, снег",  # 75
    "Пасмурно, снег, гроза",  # 76
    "Пасмурно, сильный снег",  # 77
    "Пасмурно, сильный снег, гроза",  # 78
]
pogoda_picture_num = [
    "#d",  # 1
    "#mist",  # 2

    "#d_c0",  # 3
    "#d_c0_r1",  # 4
    "#d_c0_r1_st",  # 5
    "#d_c0_r2",  # 6
    "#d_c0_r2_st",  # 7
    "#d_c0_r3",  # 8
    "#d_c0_r3_st",  # 9

    "#d_c0_rs1",  # 10
    "#d_c0_rs1_st",  # 11
    "#d_c0_rs2",  # 12
    "#d_c0_rs2_st",  # 13
    "#d_c0_rs3",  # 14
    "#d_c0_rs3_st",  # 15

    "#d_c0_s1",  # 16
    "#d_c0_s1_st",  # 17
    "#d_c0_s2",  # 18
    "#d_c0_s2_st",  # 19
    "#d_c0_s3",  # 20
    "#d_c0_s3_st",  # 21

    "#d_c1",  # 22
    "#d_c1_r1",  # 23
    "#d_c1_r1_st",  # 24
    "#d_c1_r2",  # 25
    "#d_c1_r2_st",  # 26
    "#d_c1_r3",  # 27
    "#d_c1_r3_st",  # 28

    "#d_c1_rs1",  # 29
    "#d_c1_rs1_st",  # 30
    "#d_c1_rs2",  # 31
    "#d_c1_rs2_st",  # 32
    "#d_c1_rs3",  # 33
    "#d_c1_rs3_st",  # 34

    "#d_c1_s1",  # 35
    "#d_c1_s1_st",  # 36
    "#d_c1_s2",  # 37
    "#d_c1_s2_st",  # 38
    "#d_c1_s3",  # 39
    "#d_c1_s3_st",  # 40

    "#d_c2",  # 41
    "#d_c2_r1",  # 42
    "#d_c2_r1_st",  # 43
    "#d_c2_r2",  # 44
    "#d_c2_r2_st",  # 45
    "#d_c2_r3",  # 46
    "#d_c2_r3_st",  # 47

    "#d_c2_rs1",  # 48
    "#d_c2_rs1_st",  # 49
    "#d_c2_rs2",  # 50
    "#d_c2_rs2_st",  # 51
    "#d_c2_rs3",  # 52
    "#d_c2_rs3_st",  # 53

    "#d_c2_s1",  # 54
    "#d_c2_s1_st",  # 55
    "#d_c2_s2",  # 56
    "#d_c2_s2_st",  # 57
    "#d_c2_s3",  # 58
    "#d_c2_s3_st",  # 59

    "#d_c3",  # 60
    "#d_c3_r1",  # 61
    "#d_c3_r1_st",  # 62
    "#d_c3_r2",  # 63
    "#d_c3_r2_st",  # 64
    "#d_c3_r3",  # 65
    "#d_c3_r3_st",  # 66

    "#d_c3_rs1",  # 67
    "#d_c3_rs1_st",  # 68
    "#d_c3_rs2",  # 69
    "#d_c3_rs2_st",  # 70
    "#d_c3_rs3",  # 71
    "#d_c3_rs3_st",  # 72

    "#d_c3_s1",  # 73
    "#d_c3_s1_st",  # 74
    "#d_c3_s2",  # 75
    "#d_c3_s2_st",  # 76
    "#d_c3_s3",  # 77
    "#d_c3_s3_st",  # 78
]

arrows_directions = ["⬆️", "↗️", "➡️", "↘️", "⬇️", "↙️", "⬅️", "↖️"]
arrows_directions_alp = ["Ю", "ЮЗ", "З", "СЗ", "С", "СВ", "В", "ЮВ"]
# кнопки погоды
weather_periods = ['На сейчас', 'На сегодня', 'На завтра', 'На 3 дня', 'На две недели', 'На месяц']

# кнопки диалога
talk_start_1 = KeyboardButton('Погода, серьезно?')

# создание отдельных виртуальных клавиатур
markup_retry = ReplyKeyboardMarkup(resize_keyboard=True, one_time_keyboard=True).add(KeyboardButton("Еще по-братски"))
markup_talk_start = ReplyKeyboardMarkup(resize_keyboard=True, one_time_keyboard=True).add(talk_start_1)
markup_weather_period = ReplyKeyboardMarkup(resize_keyboard=True, one_time_keyboard=True).row(weather_periods[0],
                                                                                              weather_periods[1],
                                                                                              weather_periods[2]).row(
    weather_periods[3],
    weather_periods[4],
    weather_periods[5])
